
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5095880314)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063b5de1a8e57c2f0]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ac5af99053517d53]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09bbe5d247799c91a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f444d3d84593377a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02fded69eeafebfbb]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06780cdb2f9d2ac42]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038a3874d394ce238]
aws_security_group.ecs: Refreshing state... [id=sg-01817104820a1c119]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0643033702df490c6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0094caf37924ecc1c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9321dd4a0f03441]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0708ee74755483bb1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d1f14784708f5dea]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01847c06253f6a5a3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b8049beb4cc0f4d]
aws_security_group.alb: Refreshing state... [id=sg-06b0acbe1b5245215]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:targetgroup/go-simple-server-target-group/35418404c280c12f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0708ee74755483bb11080289494]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1996458343]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008b3aa7a98eb2dd6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0df4a6dc79f929b2b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c26045e1e6dc22eb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d77837d9b95e446b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e98de56a761ff0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0775f5db85f86ab62]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:loadbalancer/app/go-simple-server-alb/3d1a1e622fe088c7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0094caf37924ecc1c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0643033702df490c61080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener-rule/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b/cd52e7adf398fad6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 1s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":13,"Program":"tfcmt","SHA1":"1c00463719964f2d464e733dcd10d6228b82bfeb","Vars":{},"WorkflowName":"Terraform"} -->